Revit 2027 API
Curve.IsCyclic Property
The boolean value that indicates whether this curve is cyclic.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCyclic { get; }
Public ReadOnly Property IsCyclic As Boolean
	Get
public:
property bool IsCyclic {
	bool get ();
}
member IsCyclic : bool with get
Return Value
Boolean
True if this curve is cyclic; otherwise, false.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace